## This is but a small step, a humble beginning

Είμαι ο Χαρίλαος Ματσακώνης και αυτό είναι το ΕίκοσιΈνα. Το ΕίκοσιΈνα δεν είναι ένα podcast σαν τα άλλα. Το ΕίκοσιΈνα δεν είναι ένα επενδυτικό podcast. Το ΕίκοσιΈνα είναι ένα podcast για το Bitcoin, τα κρυπτονομίσματα, τις αποκεντρωμένες τεχνολογίες, τον γενναίο νέο κόσμο που αναδύεται χάρη σε αυτές. 

Το ΕίκοσιΈνα είναι ένα podcast για τη χρήση αυτών των νέων δυνατοτήτων και για το πως μπορούμε να πλεύσουμε στον Ωκεανό της αποκεντρωμένης πληροφορίας με ασφάλεια. Το ΕίκοσιΈνα είναι ένα podcast επιβίωσης. 

Το ΕίκοσιΈνα είναι ένα podcast για μεγάλους.- 
